//закриті внутр. поля + методи доступу та контролю
//перевантажені опер-ри, індексування
//шаблон ф стат обробки
//массив останнього похідн.класу зберігати/читати в двійк.форматі
//виключні ситуації
//меню:
// - виведення
// - вивед.табл (заголовок/рядки необх.даних)
// - запис текст, запис двійк
// - зчит. + ім'я за замовч.
// - пошук за текст/числ полем
//Перевірка: 10 об'єктів, зберегти.
/*
Дата {Рік, Місяць, День};
Особа {Прізвище, Ім’я, Дата (народження)};
Файл {Назва, Розширення, Дата (створення), Розмір};
Текстовий Документ {Файл, Розміщення (диск, шлях), Особа (автор), Ключові слова};
Елемент архіву {Список Текстових документ архіву, Дата (створення), ступінь архівації елемента архіву};
Склад каталогу {Масив елементів архіву}.
Середнє значення кількості Текстових документів в елементах архіву та середнє значення ступеня архівації в елементах архіву.
*/

